Revit 2024 API
ReferenceWithContext.Proximity Property
 The proximity value to the ray's origin when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double Proximity { get; }
Visual Basic
Public ReadOnly Property Proximity As Double
	Get
Visual C++
public:
property double Proximity {
	double get ();
}
See Also
ReferenceWithContext Class
Autodesk.Revit.DB Namespace